Revit 2027 API
ScheduleField.Schedule Property
 The schedule that this field belongs to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewSchedule Schedule { get; }
Public ReadOnly Property Schedule As ViewSchedule
	Get
public:
property ViewSchedule^ Schedule {
	ViewSchedule^ get ();
}
member Schedule : ViewSchedule with get
Property Value
ViewSchedule
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace